const sum = require('./sum');
// 1 + 2 เท่ากับ 3
test('1 + 2 เท่ากับ 3', ()=> {
  expect(sum(1,2)).toBe(3);
});

// 20 + 1 เท่ากับ 21
test('20 + 1 เท่ากับ 21', ()=> {
  expect(sum(20,1)).toBe(21);
});

// 2 + 5 เท่ากับ ?
test('2 + 5 เท่ากับ ?', ()=> {
  expect(sum(2,5)).toBe(7);
});

// ทำอีก 3 อัน โดยการพิมพ์เอง อย่า copy

// 1 + 1 เท่ากับ 2
test('1 + 1 เท่ากับ 2', ()=> {
  expect(sum(1,1)).toBe(2);
});

// 2 + 2 เท่ากับ 4
test('2 + 2 เท่ากับ 4', ()=> {
  expect(sum(2,2)).toBe(4);
});

// 3 + 3 เท่ากับ 6
test('3 + 3 เท่ากับ 6', ()=> {
  expect(sum(3,3)).toBe(6);
});